Функция СведенияОВнешнейОбработке() Экспорт

	ДанныеДляРег = Новый Структура();
	ДанныеДляРег.Вставить("Наименование", "Пример длит. операций во внешней обработке");
	ДанныеДляРег.Вставить("БезопасныйРежим", Ложь);
	ДанныеДляРег.Вставить("Версия", "ver.: 1");
	ДанныеДляРег.Вставить("Информация", "Пример длит. операций во внешней обработке");
	ДанныеДляРег.Вставить("Вид", "ДополнительнаяОбработка");

	ТабЗнКоманды = Новый ТаблицаЗначений;
	ТабЗнКоманды.Колонки.Добавить("Идентификатор");
	ТабЗнКоманды.Колонки.Добавить("Использование");
	ТабЗнКоманды.Колонки.Добавить("Представление");

	НовСтрока = ТабЗнКоманды.Добавить();
	НовСтрока.Идентификатор = "ОткрытьОбработку";
	НовСтрока.Использование = "ОткрытиеФормы";
	НовСтрока.Представление = "Пример длит. операций во внешней обработке";
	ДанныеДляРег.Вставить("Команды", ТабЗнКоманды);

	Возврат ДанныеДляРег;

КонецФункции

Процедура ДлительнаяОперация(СтруктураПараметров, АдресРезультата) Экспорт
	
	МассивВозврат = Новый Массив;
	Для Ин = 1 ПО СтруктураПараметров.КоличествоИтераций Цикл		
		//ваш код
		Если Ин/100 - Окр(Ин/100, 0) = 0 Тогда
			МассивВозврат.Добавить(Ин);
		КонецЕсли;		
		ТекущийПроцентВыполнения = Окр(100*Ин/СтруктураПараметров.КоличествоИтераций, 0);
		ДлительныеОперации.СообщитьПрогресс(ТекущийПроцентВыполнения, СтрШаблон("Выполняется итерация %1", Ин));		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(МассивВозврат, АдресРезультата);
	
КонецПроцедуры
